
/******************************************************************************
*文件名称：main.c		       		         
*作          者：hk           							 
*描          述：处理主流程		
*创建日期：2010-3-15
*修改记录：无								
******************************************************************************/


#include "include.h"




//我的过程数据
pisc_default_data_t my_default_data=
{
	{0,0,0,0,0,0,0,0,},//触发标志
	1,//起始站
	STATION_TOTAL_NUM,//终点站
	1,//当前站
	2,//下一站
	0,//越站广播
	0,//紧急广播
	{1,0,0,0,0,0,0},//状态标志
	0,0,0,0,//越站代码
	{0},//广播优先级
	{0},//广播信源
	{{0},{0},{0},{0},{0},{0},{0},{0},},//32个报警器状态字

	0,//媒体显示模式
	{0},//司机室状态
	{0x10},//TMS状态
		
	0,//面板设置的音量参数
	
	0,//运行的距离---百分比
	1,//经过的站--不一定停车
	
	0,//保留
};

	

//★★★★★★★★★★★★★★★★★★★★主函数开始★★★★★★★★★★★★★★★★★★★

int __main(void)
{		

	//-----------------------------初始化--------------------------------
	device_init();//设备初始化

	//-----------------------------主循环---------------------------------
	while(1)
	{		
	
		// 1.系统处理
		sys_dev->proc();
		
		// 2.上位机设置处理
		ptu_dev->proc();
		debug_proc(ptu_dev->get_debug_cmd());//处理来自ptu的调试命令

		// 3.数字报站器处理
		cab_bus_dev->proc();
		
		// 4.媒体播放处理
		//media_dev->proc();
						
		// 5.音频处理器处理
		apu_dev->proc();

		// 6.列车总线处理
		tba_bus_dev->proc();
		tba_bus_dev->send_data(0xFF,0xFF,TBA_CMD_DEFAULTPACKET,1,(uint8 *)&my_default_data,sizeof(pisc_default_data_t));//发送过程数据到列车总线
		
		// 7.列车总控制器处理
		tms_dev->proc();
		
		// 8.站处理
		station_proc();
		
		// 9.广播处理
		broadcast_proc();

		//静音处理
		//if(apu_dev->get_mute_flag())
		{
		//    apu_dev->set_channel(APU_CHANNEL_NONE);//切换通道
		}
		
		// 10.主备处理
		master_proc();
		
		// 11.设备错误处理
		error_proc();
		//uart3_write_str("test uart3\n");
		// 12.硬件测试处理
		//hardware_test_proc();	
	}
}


