/******************************************************************************
*文件名称：sh9_tms.c		       		         
*作          者：hk           							 
*描          述：TCMS 数据控制处理
*创建日期：2010-3-11
*修改记录：无								
******************************************************************************/


#include "include.h"

//通信协议关键字
#define TMS_PACKET_HEAD	      0x7E
#define TMS_PACKET_END	             0x0D
#define TMS_PACKET_TAB			0x7E	//数据包分割符
#define TMS_PACKET_DLE			0x7F	//数据包全局转码符
#define TMS_PACKET_DLE_TAB		0x80	//数据包分割符的转码符
#define TMS_PACKET_DLE_DLE		0x81	//数据包转码符的转码符
#define TMS_PACKET_LENGTH		(153)//(81)


#define LEAVE_STATION_TRIGGER_DISTANCE		300    //离站此距离触发预报站广播
#define ARRIVE_STATION_TRIGGER_DISTANCE	       100    //离站此距离触发到站广播
#define EMERGENCY_PA_ID_MAX		16

#define LEAVE_STATION_PA_TRIGGER		(1 << 0)    //离站触发
#define PRE_ARRIVE_STATION_PA_TRIGGER	(1 << 1)   //预报站触发
#define SKIP_STATION_TRIGGER			(1 << 2)   //越站触发
#define EMERGENCY_PA_TRIGGER			(1 << 3)   //紧急触发
#define CLOSE_DOOR_TRIGGER				(1 << 4)
#define OPEN_DOOR_TRIGGER				(1 << 5)
#define LEAVE_STATION_TRIGGER			(1 << 6)
#define STOP_STATION_TRIGGER			(1 << 7)


#define PRE_ARRIVAL    1   //列车将要到达车站（列车车头进站前20S）
#define DEPARTURE       8  //列车出站
#define ARRIVAL           2   //到站

#define LEAVE_DELAY    0   //离站广播延时

#define close_mathod  0   // = 0 关门取open位 ； =1 关门取close 位

//接收缓冲区
static uint8 xdata tms_recv_buf[TMS_BUF_SIZE];

static uint16 xdata tms_recv_length=0;

//定时向TMS发送数据计时器
static uint32 tms_timer=0;

//static uint8 tms_get_flag=0;

//列车总控制器接收数据包结构  from tcms
__packed typedef struct
{
	uint8 fram_begin;  		// 1   0xFE

	/* 数据部分*/

	/* Port 374   16 Bytes*/
	__packed struct
	{
		uint8 oknumbercarA:1;
		uint8 okloadweightA1:1;
		uint8 okdiameterwheelA1:1;
		uint8 ac_ventilation1_onA1:1;
		uint8 ac_ventilation2_onA1:1;
		uint8 va_conallA1:1;
		uint8 va_con1A1:1;
		uint8 release_compr1startA1:1;

		uint8 release_compr2startA1:1;
		uint8 start_selftest_ep_brakeA1:1;
		uint8 lwca1_10:1;
		uint8 lwca1_11:1;
		uint8 lwca1_12:1;
		uint8 lwca1_13:1;
		uint8 lwca1_14:1;
		uint8 lwca1_15:1;	
	}lwca;		// 2-3

	uint8 port374_reserves1[2]; // 4-5
	uint32 numvercarA; 				// 6-9
	uint8 port374_reserves2[8]; //10-17    suven MVB少了8个字节

	/*Port 393   32 Bytes*/
	uint8 port_time1;  		// 18
	uint8 port_time2;			//19
	uint8 port_time3;			//20	
	uint8 port_time4;			//21
	uint8 port_time5;			//22
	uint8 port_time6;			//23

	__packed struct
	{
		uint8 oktimedate:1;
		uint8 restricted_drive:1;
		uint8 activation_on_gw:1;
		uint8 cab_manned_A1:1;
		uint8 cab_manned_A2:1;
		uint8 lwg1_5:1;
		uint8 lwg1_6:1;
		uint8 lwg1_7:1;
		
		uint8 lwg1_8:1;
		uint8 lwg1_9:1;
		uint8 lwg1_10:1;
		uint8 lwg1_11:1;
		uint8 lwg1_12:1;
		uint8 lwg1_13:1;
		uint8 lwg1_14:1;
		uint8 lwg1_15:1;		
	}lwg1;//24-25
	
	uint8 port393_reserves[24]; //26-49

	/*Port 481  16 Bytes*/
	__packed struct
	{
		uint8 atc_a1_reserves2:8;

		uint8 ato_mode:1;
		uint8 atp_reverse:1;
		uint8 leftdoor_open:1;
		uint8 rightdoor_open:1;
		uint8 ato_depart:1;
		uint8 atc_a1_reserves1:3;
	}atc_a1;  //50-51

	uint16 atc_a1_code_id;		//52-53
	uint16 atc_a1_platform_id; 	//54-55
	uint8 port481_reserves[10]; //56-65

	/*Port 652   32 Bytes*/
	__packed struct
	{
		uint8 haul_drive_active:1;
		uint8 skip_station:1;
		uint8 door_open:1;
		uint8 lwp1_11:1;
		uint8 manual_leftdoor_open:1;
		uint8 manual_rightdoor_open:1;
		uint8 manual_nextstation:1;
		uint8 manual_docked_station:1;
	
		uint8 oknumbercarB:1;
		uint8 self_test:1;
		uint8 cab_a1_manned:1;
		uint8 cab_a2_manned:1;
		uint8 train_manned:1;
		uint8 mechanical_coupler_active:1;
		uint8 electr_coupler_a1_active:1;
		uint8 electr_coupler_a2_active:1;		
	}lwp1;   //66-67

	__packed struct
	{
		uint8 lwp2_8:1;
		uint8 lwp2_9:1;
		uint8 lwp2_10:1;
		uint8 lwp2_11:1;
		uint8 lwp2_12:1;
		uint8 lwp2_13:1;
		uint8 lwp2_14:1;
		uint8 lwp2_15:1;
	
		uint8 chinese_disable:1;
		uint8 english_disable:1;
		uint8 cantonese_disable:1;
		uint8 transfer_announce_disable:1;
		uint8 led_map_disable:1;
		uint8 lwp2_5:1;
		uint8 lwp2_6:1;
		uint8 lwp2_7:1;				
	}lwp2;  //68-69

	uint8 start_station;   	//70
	uint8 end_station;  		//71
	uint8 next_station;		//72
	uint8 route_number;	//73
	uint32 numbercarB;		//74-77
	uint16 emc_annoucement;  //78-79
#if 1
	uint8 port652_reserves[18]; //80-97

	/*Port 653   4 Bytes*/
	__packed struct
	{
		uint8  call_picu1_a1:1;
		uint8  call_picu2_a1:1;
		uint8  call_picu3_a1:1;
		uint8  call_picu1_b:1;
		uint8  call_picu2_b:1;
		uint8  call_picu3_b:1;
		uint8  call_picu1_a2:1;
		uint8  call_picu2_a2:1;
		
		uint8  call_picu3_a2:1;
		uint8  lwp11_9:1;
		uint8  active_picu1_a1:1;
		uint8  res_picu1_a1:1;
		uint8  active_picu2_a1:1;
		uint8  res_picu2_a1:1;
		uint8  active_picu3_a1:1;
		uint8  res_picu3_a1:1;
	}lwp11; //98-99

	__packed struct
	{
		uint8  active_picu1_b:1;
		uint8  res_picu1_b:1;
		uint8  active_picu2_b:1;
		uint8  res_picu2_b:1;
		uint8  active_picu3_b:1;
		uint8  res_picu3_b:1;
		uint8  active_picu1_a2:1;
		uint8  res_picu1_a2:1;
		
		uint8  active_picu2_a2:1;
		uint8  res_picu2_a2:1;
		uint8  active_picu3_a2:1;
		uint8  res_picu3_a2:1;
		uint8  lwp12_12;
		uint8  lwp12_13;
		uint8  lwp12_14;
