//&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&& 处理器基本设置 &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
//*文件名称:mcu.h

//*文件作用:处理器基本设置

//*文件作者:翟  鹏

//*创建日期:2007年5月
//&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&



#ifndef MCU_H
#define MCU_H



//mcu时钟参数
#define Fosc		16000000		//晶振频率 10MHz~25MHz 应当与实际一至
#define Fcclk		48000000		//系统主频 必须为Fosc的整数倍(1~32) 且<=60MHZ
#define Fpcl		48000000		//VPB时钟频率，只能为(Fcclk / 4)的1 ~ 4倍



extern void mcu_init(void);

#define RD_EXT_IO_STAUTS				(*(volatile unsigned short *)0x62000000)

#endif


