//&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&定时器0驱动程序&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
//*文件名称:timer0.c

//*文件作用:定时器0驱动程序

//*文件作者:翟  鹏

//*创建日期:2007年5月
//&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&



#include "include.h"



static uint16 timer0_ms=0;//记忆定时器周期
static uint16 delay_count=0;//延时计数器
uint32 timer0_clock=0;//系统时钟
static uint32 timer0_dog_clock=0;//软狗



//***********************************************************************************************************************
//函数作用:定时器0中断服务程序
//参数说明:
//注意事项:
//返回说明:无
//***********************************************************************************************************************
void T0TIMI_IRQHandler(void)
{
	//关中断
	TIM0_CR2|=0x2000;
	//清除中断标志
	TIM0_SR&=(~0x2000);
			
	delay_count+=timer0_ms;//延时计数器增加定时器的周期数
	timer0_clock+=timer0_ms;//系统时钟增加定时器的周期数
	if((timer0_clock-timer0_dog_clock)>=300000)//软件看门狗 在boot中不能喂
	{
		print_line("softdog reset");
		while(1);
	}
			
	//开中断
	TIM0_CR2|=0x2000;
}

//***********************************************************************************************************************
//函数作用:定时器0初始化---设置周期和中断钩子
//参数说明:
//注意事项:
//返回说明:无
//***********************************************************************************************************************
void timer0_init(uint16 ms)
{
	//注册中断
	//TIMER0_IRQ_SLOT=(uint32)TIMER0_HANDLER;//设置中断处理句柄地址---在IRQ.S中已经完成
	TIMER0_IRQ_SLOT=(TIMER0_IRQ_SLOT&0xFFFF0000)|TIMER0_IRQ_PRIORITY;//设置优先级--最高15
	EIC_IER|=1<<TIMER0_IRQ_VECTOR;//使能中断控制器相应的槽

	//设置寄存器
	TIM0_CR1=0x0000;
	TIM0_CR2=0x0000;
	TIM0_SR=0x0000;
	TIM0_CR2=(TIM0_CR2&0xFF00)|((Fcclk*ms/1000/65536)-1);//设置分频系数
	timer0_ms=ms;//记忆定时器频率
	TIM0_CR1|=0x8000;//开定时器
	//开中断
	TIM0_CR2|=0x2000;
}

//***********************************************************************************************************************
//函数作用:检查应用层是否时间到了
//参数说明:timer---应用层定义的计数器	interval---运行间隔
//注意事项:
//返回说明:无
//***********************************************************************************************************************
uint8 timer0_check_timer(uint32 *timer, uint32 interval)
{
	if(interval)
	{
		//判断溢出
		if(timer0_clock<(*timer))
			*timer=0;
		//比较是否时间到
		if(timer0_clock-(*timer)>=interval)
		{
			*timer=timer0_clock;
			return 1;
		}
	}
	return 0;
}

//***********************************************************************************************************************
//函数作用:得到timer0时钟
//参数说明:无
//注意事项:
//返回说明:无
//***********************************************************************************************************************
uint32 timer0_get_clock(void)
{
	return timer0_clock;
}

//***********************************************************************************************************************
//函数作用:毫秒延时函数
//参数说明:无
//注意事项:count--毫秒数
//返回说明:无
//***********************************************************************************************************************
void timer0_mdelay(uint16 count)
{
	delay_count=0;
	while(delay_count<count)
		dog();//等待时间到
}

//***********************************************************************************************************************
//函数作用:秒延时函数
//参数说明:无
//注意事项:count--秒数
//返回说明:无
//***********************************************************************************************************************
void timer0_delay(uint16 count)
{
	while(count--)
		timer0_mdelay(1000);
}

//***********************************************************************************************************************
//函数作用:喂软件狗
//参数说明:无
//注意事项:
//返回说明:无
//***********************************************************************************************************************
void timer0_dog_feed(void)
{
	timer0_dog_clock=timer0_clock;
}


